# StorageType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillScheme..::..StorageType Property
ColorFillScheme Class See Also
---
Represents the type of parameter values stored in entries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public StorageType StorageType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StorageType As StorageType
	Get
```

Visual C++
---
```text
public:
property StorageType StorageType {
	StorageType get ();
}
```

# See Also
ColorFillScheme Class
Autodesk.Revit.DB Namespace